# Configuración de Pandas y su Importación

In [5]:
# Instalar pandas
# !pip install pandas
import pandas as pd

# Crear una serie a partir de una lista

In [13]:
carros = ['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Audi']
carros

['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Audi']

In [15]:
# Crear una serie
pd.Series(carros)

0    Challenger
1        Toyota
2         Mazda
3           KIA
4    Mitsubishi
5          Audi
dtype: object

# Crear un Dataframe a partir de una lista de diccionarios (JSON)

In [75]:
datos = [
    {"Nombre": 'Jetta Variant', "Motor": 'Motor 4.0 Turbo', "Year": 2020, "Kilometraje": 44410.0, "Cero_km": False, "Valor": 120000},
    {"Nombre": 'Camaro', "Motor": 'Motor 4.54 LS', "Year": 2022, "Kilometraje": 12000.0, "Cero_km": False, "Valor": 480000},
    {"Nombre": 'Challenger', "Motor": 'Motor Turbo 4.3', "Year": 2025, "Kilometraje": 0.0, "Cero_km": True, "Valor": 680000},
    {"Nombre": 'Audi R8 Spyder', "Motor": 'Motor 8.0 Turbo', "Year": 2032, "Kilometraje": 0.0, "Cero_km": True, "Valor": 4450000}
]
datos

[{'Nombre': 'Jetta Variant',
  'Motor': 'Motor 4.0 Turbo',
  'Year': 2020,
  'Kilometraje': 44410.0,
  'Cero_km': False,
  'Valor': 120000},
 {'Nombre': 'Camaro',
  'Motor': 'Motor 4.54 LS',
  'Year': 2022,
  'Kilometraje': 12000.0,
  'Cero_km': False,
  'Valor': 480000},
 {'Nombre': 'Challenger',
  'Motor': 'Motor Turbo 4.3',
  'Year': 2025,
  'Kilometraje': 0.0,
  'Cero_km': True,
  'Valor': 680000},
 {'Nombre': 'Audi R8 Spyder',
  'Motor': 'Motor 8.0 Turbo',
  'Year': 2032,
  'Kilometraje': 0.0,
  'Cero_km': True,
  'Valor': 4450000}]

In [77]:
dataset = pd.DataFrame(datos)
dataset

           Nombre            Motor  Year  Kilometraje  Cero_km    Valor
0   Jetta Variant  Motor 4.0 Turbo  2020      44410.0    False   120000
1          Camaro    Motor 4.54 LS  2022      12000.0    False   480000
2      Challenger  Motor Turbo 4.3  2025          0.0     True   680000
3  Audi R8 Spyder  Motor 8.0 Turbo  2032          0.0     True  4450000

In [63]:
# Nombre de las columnas
print(dataset.columns.values)

['Nombre' 'Motor' 'Year' 'Kilometraje' 'Cero_km' 'Valor']

In [65]:
# Mostrar las primeras 3 columnas
print(dataset.columns.values[:4])

['Nombre' 'Motor' 'Year' 'Kilometraje']

In [67]:
# Mostrar última columna
print(dataset.columns.values[-1])

Valor

### Cambiar orden en el que se muestran las columnas

In [47]:
dataset[['Nombre', 'Valor', 'Motor', 'Year', 'Kilometraje', 'Cero_km']]

           Nombre    Valor            Motor  Year  Kilometraje  Cero_km
0   Jetta Variant   120000  Motor 4.0 Turbo  2020      44410.0    False
1          Camaro   480000    Motor 4.54 LS  2022      12000.0    False
2      Challenger   680000  Motor Turbo 4.3  2025          0.0     True
3  Audi R8 Spyder  4450000  Motor 8.0 Turbo  2032          0.0     True

### Cambiar nombre de las columnas

In [79]:
dataset = dataset.rename(columns = {
    "Nombre": 'Name', 
    "Motor": 'Engine', 
    "Year": 'Year', 
    "Kilometraje": 'Mileage', 
    "Cero_km": 'Zero_ml', 
    "Valor": 'Price'
})
dataset

             Name           Engine  Year  Mileage  Zero_ml    Price
0   Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False   120000
1          Camaro    Motor 4.54 LS  2022  12000.0    False   480000
2      Challenger  Motor Turbo 4.3  2025      0.0     True   680000
3  Audi R8 Spyder  Motor 8.0 Turbo  2032      0.0     True  4450000

### Seleccionar columnas

In [82]:
dataset["Engine"]

0    Motor 4.0 Turbo
1      Motor 4.54 LS
2    Motor Turbo 4.3
3    Motor 8.0 Turbo
Name: Engine, dtype: object

In [90]:
dataset[["Name", "Price"]]

             Name    Price
0   Jetta Variant   120000
1          Camaro   480000
2      Challenger   680000
3  Audi R8 Spyder  4450000

### Mostrar primeras 2 filas

In [93]:
dataset.head(2)

            Name           Engine  Year  Mileage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False  120000
1         Camaro    Motor 4.54 LS  2022  12000.0    False  480000

### Ver las últimas filas

In [96]:
dataset.tail(2)

             Name           Engine  Year  Mileage  Zero_ml    Price
2      Challenger  Motor Turbo 4.3  2025      0.0     True   680000
3  Audi R8 Spyder  Motor 8.0 Turbo  2032      0.0     True  4450000

### Obtener un resumen del dataset

In [99]:
dataset.describe()

              Year       Mileage         Price
count     4.000000      4.000000  4.000000e+00
mean   2024.750000  14102.500000  1.432500e+06
std       5.251984  20981.945215  2.024967e+06
min    2020.000000      0.000000  1.200000e+05
25%    2021.500000      0.000000  3.900000e+05
50%    2023.500000   6000.000000  5.800000e+05
75%    2026.750000  20102.500000  1.622500e+06
max    2032.000000  44410.000000  4.450000e+06

### Seleccionar líneas (datos)

In [112]:
# Mostrar las primeras 2 filas
dataset[:2]

            Name           Engine  Year  Mileage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False  120000
1         Camaro    Motor 4.54 LS  2022  12000.0    False  480000

In [114]:
# Mostrar la última fila
dataset[-1:]

             Name           Engine  Year  Mileage  Zero_ml    Price
3  Audi R8 Spyder  Motor 8.0 Turbo  2032      0.0     True  4450000

In [116]:
# Mostrar las 2 últimas filas
dataset[-2:]

             Name           Engine  Year  Mileage  Zero_ml    Price
2      Challenger  Motor Turbo 4.3  2025      0.0     True   680000
3  Audi R8 Spyder  Motor 8.0 Turbo  2032      0.0     True  4450000

### Utilizar loc (.loc) para secciones

In [128]:
# Elemento con un índice 3
dataset.loc[3]

Name        Audi R8 Spyder
Engine     Motor 8.0 Turbo
Year                  2032
Mileage                0.0
Zero_ml               True
Price              4450000
Name: 3, dtype: object

In [130]:
# Elementos de los índices 1 y 2
dataset.loc[[1,2]]

         Name           Engine  Year  Mileage  Zero_ml   Price
1      Camaro    Motor 4.54 LS  2022  12000.0    False  480000
2  Challenger  Motor Turbo 4.3  2025      0.0     True  680000

In [138]:
# Mostrar nombre y precio
dataset.loc[: ,['Name', 'Price']]

             Name    Price
0   Jetta Variant   120000
1          Camaro   480000
2      Challenger   680000
3  Audi R8 Spyder  4450000

In [140]:
dataset.loc[1:2, ['Name', 'Price']]

         Name   Price
1      Camaro  480000
2  Challenger  680000